In [9]:
import pandas as pd 
import numpy as np
import datetime as datetime
import unidecode as unidecode
import pyarrow

In [4]:
pd.options.display.max_columns=None

# CARGAR DATOS

In [17]:
df1=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente1.csv',sep=';',encoding='latin-1')
df1.head(4)

,Unnamed: 0,id_cliente,nombre,apellidoS,FECHA NACIMIENTO,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022

In [18]:
df2=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente2.csv',sep=';',encoding='latin-1')
df2.head(4)

,Unnamed: 0,id_orden,id_cliente,Producto,monto DE COMPRA,Fecha orden,Identificacionn,tipo venta,REGION
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este

In [19]:
df3=pd.read_csv('C:/Users/soyju/Downloads/PRICNIPIOS M&S/INTRODUCCION A PHYTON/INTRODUCCION/DatosExcel/datos_cliente3.csv',sep=';',encoding='latin-1')
df3.head(4)

   Unnamed: 0  id_orden  tipo_venta REGION DE VENTA  porcentaje_pago
0           0      1001  presencial            Este              8.0
1           1      1002      online           Norte             12.0
2           2      1003      online            Este             10.0
3           3      1004  presencial            Este              8.0

In [20]:
print(df1.shape)
print(df2.shape)
print(df3.shape)

(2500, 8)
(2500, 9)
(2500, 5)

# CONOCER DATOS

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        2500 non-null   int64
 1   id_cliente        2400 non-null   float64
 2   nombre            2400 non-null   object
 3   apellidoS         2400 non-null   object
 4   FECHA NACIMIENTO  2400 non-null   object
 5   ciudad            2299 non-null   object
 6   fecha_registro    2400 non-null   object
 7   ultima_compra     2400 non-null   object
dtypes: float64(1), int64(1), object(6)
memory usage: 156.4+ KB

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       2500 non-null   int64
 1   id_orden         2500 non-null   int64
 2   id_cliente       2406 non-null   float64
 3   Producto         2500 non-null   object
 4   monto DE COMPRA  2399 non-null   float64
 5   Fecha orden      2399 non-null   object
 6   Identificacionn  2500 non-null   float64
 7   tipo venta       2500 non-null   object
 8   REGION           2500 non-null   object
dtypes: float64(3), int64(2), object(4)
memory usage: 175.9+ KB

In [23]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       2500 non-null   int64
 1   id_orden         2500 non-null   int64
 2   tipo_venta       2500 non-null   object
 3   REGION DE VENTA  2500 non-null   object
 4   porcentaje_pago  2500 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 97.8+ KB

In [24]:
nulos1=df1.isnull().sum()
nulos1

Unnamed: 0            0
id_cliente          100
nombre              100
apellidoS           100
FECHA NACIMIENTO    100
ciudad              201
fecha_registro      100
ultima_compra       100
dtype: int64

In [25]:
nulos2=df2.isnull().sum()
nulos2

Unnamed: 0           0
id_orden             0
id_cliente          94
Producto             0
monto DE COMPRA    101
Fecha orden        101
Identificacionn      0
tipo venta           0
REGION               0
dtype: int64

In [26]:
nulos3=df3.isnull().sum()
nulos3

Unnamed: 0         0
id_orden           0
tipo_venta         0
REGION DE VENTA    0
porcentaje_pago    0
dtype: int64

# AJUSTAR VARIABLES

In [28]:
df1.columns

Index(['Unnamed: 0', 'id_cliente', 'nombre', 'apellidoS   ',
       'FECHA NACIMIENTO', 'ciudad', 'fecha_registro  ', 'ultima_compra'],
      dtype='object')

In [31]:
df1['fecha_registro  ']

0       19/01/2022
1       21/01/2022
2       22/02/2022
3       25/01/2022
4       15/02/2022
           ...
2495    04/01/2022
2496    12/03/2022
2497    16/03/2022
2498    04/01/2022
2499    19/01/2022
Name: fecha_registro  , Length: 2500, dtype: object

In [32]:
df1_rename=df1.rename(columns={'apellidoS   ':'apellidos','FECHA NACIMIENTO':'fecha_naciemiento','fecha_registro  ':'fecha_registro'})

In [33]:
df1_rename.head(2)

,Unnamed: 0,id_cliente,nombre,apellidos,fecha_naciemiento,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022

In [45]:
df2.columns

Index(['Unnamed: 0', 'id_orden', 'id_cliente', 'Producto', 'monto DE COMPRA',
       'Fecha orden', 'Identificacionn', 'tipo venta', 'REGION'],
      dtype='object')

In [63]:
df2_rename=df2.rename(columns={'Producto':'producto','monto DE COMPRA':'monto de compra','Identificacionn':'identificacion', 'Fecha orden':'fecha_orden','tipo venta':'tipo_venta','REGION':'region'})

In [64]:
df2_rename.head(4)

,Unnamed: 0,id_orden,id_cliente,producto,monto de compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este

In [52]:
df3.columns

Index(['Unnamed: 0', 'id_orden', 'tipo_venta', 'REGION DE VENTA',
       'porcentaje_pago'],
      dtype='object')

In [53]:
df3_rename=df3.rename(columns={'REGION DE VENTA':'region_de_venta'})

In [54]:
df3_rename.head(4)

   Unnamed: 0  id_orden  tipo_venta region_de_venta  porcentaje_pago
0           0      1001  presencial            Este              8.0
1           1      1002      online           Norte             12.0
2           2      1003      online            Este             10.0
3           3      1004  presencial            Este              8.0

# EXPLORACIÓN DE DATOS

In [55]:
df1_rename.head(5)

,Unnamed: 0,id_cliente,nombre,apellidoS,FECHA NACIMIENTO,ciudad,fecha_registro,ultima_compra
0,0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022

In [65]:
df2_rename.head(5)

,Unnamed: 0,id_orden,id_cliente,producto,monto de compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698.0,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420.0,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449.0,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088.0,presencial,Este
4,4,1005,NaN,A,338.98,27/04/2023,90319318.0,presencial,Oeste

In [66]:
df2_rename['identificacion']=df2_rename['identificacion'].astype(str).str.replace('.0','')
df2_rename

,Unnamed: 0,id_orden,id_cliente,producto,monto de compra,fecha_orden,identificacion,tipo_venta,region
0,0,1001,273.0,A,300.70,31/10/2022,43453698,presencial,Este
1,1,1002,1468.0,B,106.56,07/06/2021,27299420,online,Norte
2,2,1003,NaN,E,133.42,02/04/2021,23461449,online,Este
3,3,1004,NaN,C,65.44,07/12/2020,15328088,presencial,Este
4,4,1005,NaN,A,338.98,27/04/2023,90319318,presencial,Oeste
...,...,...,...,...,...,...,...,...,...
2495,2495,3496,245.0,E,312.81,25/04/2022,74480627,online,Norte
2496,2496,3497,513.0,B,278.91,18/06/2024,81810460,online,Norte
2497,2497,3498,NaN,C,80.55,27/05/2024,18684931,venta telefónica,Norte
2498,2498,3499,896.0,A,93.44,16/02/2020,76712135,presencial,Sur
2499,2499,3500,2234.0,B,211.20,13/09/2021,33523570,online,Sur

In [68]:
df1_drop=df1_rename.drop('Unnamed: 0',axis=1)
df2_drop=df2_rename.drop('Unnamed: 0',axis=1)
df3_drop=df3_rename.drop('Unnamed: 0',axis=1)

In [69]:
df1_drop

,id_cliente,nombre,apellidoS,FECHA NACIMIENTO,ciudad,fecha_registro,ultima_compra
0,1.0,Ana,Díaz,06/01/2000,Bogotá,19/01/2022,14/02/2022
1,2.0,Carlos,López,02/08/1980,Barranquilla,21/01/2022,15/02/2022
2,3.0,Pedro,Pérez,10/06/1976,Cartagena,22/02/2022,04/04/2022
3,4.0,Juan,López,17/04/1993,Cartagena,25/01/2022,07/03/2022
4,5.0,Elena,Pérez,21/07/2000,Barranquilla,15/02/2022,28/03/2022
...,...,...,...,...,...,...,...
2495,2496.0,Luis,Pérez,18/02/1982,Cartagena,04/01/2022,17/03/2022
2496,2497.0,Ana,Rodríguez,19/05/2001,Bogotá,12/03/2022,07/01/2022
2497,2498.0,Elena,López,13/08/1959,Bogotá,16/03/2022,14/03/2022
2498,2499.0,Rosa,Rodríguez,09/06/1954,Cali,04/01/2022,23/03/2022
2499,2500.0,Pedro,Gómez,18/05/1979,Bogotá,19/01/2022,21/01/2022

In [70]:
df2_drop

,id_orden,id_cliente,producto,monto de compra,fecha_orden,identificacion,tipo_venta,region
0,1001,273.0,A,300.70,31/10/2022,43453698,presencial,Este
1,1002,1468.0,B,106.56,07/06/2021,27299420,online,Norte
2,1003,NaN,E,133.42,02/04/2021,23461449,online,Este
3,1004,NaN,C,65.44,07/12/2020,15328088,presencial,Este
4,1005,NaN,A,338.98,27/04/2023,90319318,presencial,Oeste
...,...,...,...,...,...,...,...,...
2495,3496,245.0,E,312.81,25/04/2022,74480627,online,Norte
2496,3497,513.0,B,278.91,18/06/2024,81810460,online,Norte
2497,3498,NaN,C,80.55,27/05/2024,18684931,venta telefónica,Norte
2498,3499,896.0,A,93.44,16/02/2020,76712135,presencial,Sur
2499,3500,2234.0,B,211.20,13/09/2021,33523570,online,Sur

In [71]:
df3_drop

      id_orden        tipo_venta region_de_venta  porcentaje_pago
0         1001        presencial            Este              8.0
1         1002            online           Norte             12.0
2         1003            online            Este             10.0
3         1004        presencial            Este              8.0
4         1005        presencial           Oeste              7.0
...        ...               ...             ...              ...
2495      3496            online           Norte             12.0
2496      3497            online           Norte             12.0
2497      3498  venta telefónica           Norte              5.0
2498      3499        presencial             Sur              9.0
2499      3500            online             Sur             11.0

[2500 rows x 4 columns]